app/Http/Controllers/Web/WebController.php

    public function home(Request $request)
    {
        $cookieExists = Cookie::get('videoViewed');
        // dd($cookieExists);
        if ($cookieExists == null) {
            $cookieTime = time() + 60 * 60 * 24 * 30; // 30 days
            $token = str_random(32);

            Cookie::queue('videoViewed', $token, $cookieTime);
            DB::table('unique_users_ids')->insert(['unique_token' => $token]);

        }
        $notifIds = explode(',', request()->get('notify_ids'));

        if (!empty($notifIds)) {
            DB::table('notifications')
                ->whereIn('notify_id', $notifIds)
                ->update(['read' => 1, ]);
        }

        $video = DB::table('videos')->where('video_id', intval(request()->get('videoId')))->first();
        $sharedVideoId = '';
        $sharedVideoSrc = '';

        $homeHeaderVideo = DB::table('videos as v')->select('v.video', 'v.user_id')
            ->leftJoin('users as u', 'u.user_id', 'v.user_id')
            ->where('u.active', 1)
            ->where('u.deleted', 0)
            ->where('v.active', 1)
            ->where('v.flag', 0)
            ->where('v.privacy', 0)
            ->where('v.deleted', 0)
            ->inRandomOrder()->first();
---
update `notifications` set `read` = 1 where `notify_id` in ('')
select * from `videos` where `video_id` = 0 limit 1
select `v`.`video`, `v`.`user_id` from `videos` as `v` left join `users` as `u` on `u`.`user_id` = `v`.`user_id` where `u`.`active` = 1 and `u`.`deleted` = 0 and `v`.`active` = 1 and `v`.`flag` = 0 and `v`.`privacy` = 0 and `v`.`deleted` = 0 order by RAND() limit 1

            $sharedVideoId = request()->get('videoId');
            $sharedVideoSrc = asset(Storage::url('public/videos/' . $video->user_id . '/' . $video->video));
        }
        $home_data = DB::table('home_settings')->first();
---
select * from `home_settings` limit 1

    public function videoInfo($videoId)
    {
        $video = DB::table('videos as v')
            ->join('users as u', 'u.user_id', 'v.user_id')
            ->leftJoin('user_verify as uv', function ($join) {
            $join->on('uv.user_id', '=', 'v.user_id')
                ->where('uv.verified', 'A');
        })
            // ->leftJoin('user_verify as uv', 'uv.user_id', 'v.user_id')
            ->select(DB::raw('u.user_id,u.username,v.title,v.description, v.created_at,v.tags, v.total_views, v.video_id, u.user_dp, u.login_type, CONCAT(fname," ",lname) as name, uv.verified'))
            ->where('v.video_id', $videoId)
            ->first();
---
select u.user_id,u.username,v.title,v.description, v.created_at,v.tags, v.total_views, v.video_id, u.user_dp, u.login_type, CONCAT(fname," ",lname) as name, uv.verified from `videos` as `v` inner join `users` as `u` on `u`.`user_id` = `v`.`user_id` left join `user_verify` as `uv` on `uv`.`user_id` = `v`.`user_id` and `uv`.`verified` = 'A' where `v`.`video_id` = '41' limit 1

        $comments = DB::table('comments as c')
            //->leftJoin('videos as v', 'c.video_id', 'v.video_id')
            ->join('users as u', 'u.user_id', 'c.user_id')
            // ->leftJoin('user_verify as uv', 'uv.user_id', 'c.user_id')
            ->leftJoin('user_verify as uv', function ($join) {
            $join->on('uv.user_id', '=', 'c.user_id')
                ->where('uv.verified', 'A');
        })
            ->select('u.user_id', 'u.username', 'c.comment', 'c.updated_on', 'u.login_type', 'u.user_dp', 'uv.verified')
            ->where('c.video_id', $videoId)
            ->paginate(config('app.view_per_page'));
---
select count(*) as aggregate from `comments` as `c` inner join `users` as `u` on `u`.`user_id` = `c`.`user_id` left join `user_verify` as `uv` on `uv`.`user_id` = `c`.`user_id` and `uv`.`verified` = 'A' where `c`.`video_id` = '41'

        }


        $is_follow = DB::table('follow')
            ->where('follow_to', $video->user_id)
            ->where('follow_by', $u_id)
            ->exists();
---
select exists(select * from `follow` where `follow_to` = 7 and `follow_by` = 0) as `exists`